export const PROMO_TYPES = [
  'Кэшбек',
  'Лотереи',
  'Турниры',
  'Акции',
  'Бездепы',
  'Депозитки',
  'Пререлизы',
  'Прочие рассылки',
  'Спорт',
  'СММ-инфо'
] as const;

export const PROMO_KINDS: { [key: string]: string[] } = {
  'Турниры': ['Регулярные', 'Локальные', 'Сетевые', 'Гео'],
  'Акции': ['Глобальные', 'Сетевые', 'Локальные'],
  'Бездепы': ['СНГ', 'Гео'],
  'Депозитки': ['СНГ', 'Гео'],
  'Спорт': ['Core180', 'Киберспорт', 'Другое']
};

export const CHANNEL_TYPES = [
  'E-mail',
  'MSGR',
  'BPS',
  'PUSH',
  'SMM',
  'Баннер',
  'Страница',
  'Новости'
] as const; 